Recuperacion_2EVA/Repaso_01_TarjetaRed.tex
% Created 2020-02-10 lun 19:53
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[newfloat]{minted}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Angel Berlanas Vicente}
\date{\today}
\title{UD08 - Repaso - Tarjetas Ethernet}
\hypersetup{
 pdfauthor={Angel Berlanas Vicente},
 pdftitle={UD08 - Repaso - Tarjetas Ethernet},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\tableofcontents


\section{Aviso navegantes}
\label{sec:orgf24394d}

Leed atentamente los enunciados de las actividades y buscad soluciones que se
adapten a las necesidades.

No busquéis en Internet las soluciones, pensar una vosotr@s y a partir de esa
solución, buscad los trozos necesarios para que funcione.

\section{Pregunta 01 : Drivers}
\label{sec:org234b664}

¿Qué es un driver? ¿Qué es un módulo del kernel?

\section{Pregunta 02 : Drivers y Virtualbox}
\label{sec:org0ae213d}

Con una máquina virtual que tengáis instalada con un sistema basado en Ubuntu,
realizar los siguientes pasos:

\begin{itemize}
\item Establecer que red está en "Adaptador Puente".
\item Iniciar la MV.
\item Comprobar la ip de la tarjeta de red.
\item Instalar el \texttt{openssh-server} en la MV (\emph{Guest}).
\item Intentar conectaros a la máquina (\emph{Guest}) mediante ssh : \texttt{ssh
    usuario@maquinaVM}
\item Adjuntar captura de haberlo conseguido.
\end{itemize}

Documenta todo el proceso.

Realiza la misma conexión pero estableciendo la red en el VirtualBox en los
siguientes modos (recuerda que debes reiniciar tras cada cambio):

\begin{center}
\begin{tabular}{lll}
Modo & IP de MV & Resultado (SI/NO)\\
\hline
Solo anfitrion &  & \\
Nat &  & \\
Red NAT &  & \\
\end{tabular}
\end{center}

\section{Pregunta 03 : NAT y Red NAT}
\label{sec:org49d79ae}

¿Qué diferencia hay entre NAT y Red NAT?¿Podemos conectarnos desde el \emph{Guest}
al \emph{Host}?. ¿Podemos hacer ping? 

\section{Pregunta 04 : Ethernet}
\label{sec:org8b5714b}

Todas las tarjetas de red son similares, sin embargo debemos diferenciar entre
las alámbricas y las inalámbricas. El estándar de ethernet es el \texttt{802.3} del
IEEE.

¿Cuáles son las velocidades actuales de las tarjetas de red respecto a la
conexión ethernet?. 

\section{Pregunta 05 : Wifi}
\label{sec:org075cab0}

Las tarjetas Wifi son muy habituales hoy en dia. El estándar de WiFi es el
\texttt{802.11}, que podéis encontrar en internet fácilmente.

La configuración de las WiFis requiere de una seríe de parámetros habituales:

Elabora un pequeño texto (no más de 200 palabras) donde expliques cuáles son
los pasos necesarios para \emph{conectarte} a una red Wifi.

\section{Pregunta 06 : Canales Wifi}
\label{sec:orgc4aeb4f}

De la Wikipedia:

Los estándares 802.11b y 802.11g utilizan la banda de 2,4 GHz. En esta banda
se definieron 11 canales utilizables por equipos wifi, que pueden configurarse
de acuerdo a necesidades particulares. Sin embargo, los 11 canales no son
completamente independientes (un canal se superpone y produce interferencias
hasta un canal a 4 canales de distancia). El ancho de banda de la señal (22
MHz) es superior a la separación entre canales consecutivos (5 MHz), por eso
se hace necesaria una separación de al menos 5 canales con el fin de evitar
interferencias entre celdas adyacentes, ya que al utilizar canales con una
separación de 5 canales entre ellos (y a la vez cada uno de estos con una
separación de 5 MHz de su canal vecino) entonces se logra una separación final
de 25 MHz, lo cual es mayor al ancho de banda que utiliza cada canal del
estándar 802.11, el cual es de 22 MHz. Tradicionalmente se utilizan los
canales 1, 6 y 11, aunque se ha documentado que el uso de los canales 1, 5, 9
y 13 (en dominios europeos) no es perjudicial para el rendimiento de la red.

Describe \emph{con tus palabras} qué nos dice este texto.

Utilizando las herramientas necesarias  (\href{https://bestforandroid.com/wifi-signal-apps/}{este enlace es un buen punto de
partida}), comprueba la conectividad de tu casa.

¿Qué canales se están usando?

\section{Pregunta 07 : Comandos de red Windows}
\label{sec:org90d930a}

Elabora un pequeño listado de comandos de Windows que nos permitan conocer el
estado de la red:

\begin{center}
\begin{tabular}{ll}
Función & Comando\\
\hline
Saber la IP & \\
Cambiar la IP & \\
Forzar la petición DHCP & \\
Resolver una dirección de Internet & \\
Reiniciar la red & \\
Vaciar la caché de DNS & \\
Obtener la puerta de enlace & \\
\end{tabular}
\end{center}

\section{Pregunta 08 : Comandos de red (GNU/LinuX)}
\label{sec:org28836be}

Elabora un pequeño listado de comandos de GNU/LinuX que nos permitan conocer el
estado de la red:

\begin{center}
\begin{tabular}{ll}
Función & Comando\\
\hline
Saber la IP & \\
Cambiar la IP & \\
Forzar la petición DHCP & \\
Resolver una dirección de Internet & \\
Reiniciar la red & \\
Vaciar la caché de DNS & \\
Obtener la puerta de enlace & \\
\end{tabular}
\end{center}
\end{document}
